export const timelineData = [
    {
        year: '2020', events: [
            { month: '02', title: 'VRChat一度目の出会い。VRChatのアカウント作成', description: 'Oculus Riftを持ってたのでたぶん何かできることないかと思って作るだけ作ってたっぽい（覚えてない）。' },
            { month: '12', title: 'VRChat二度目の出会い「VRChatはじめました」', description: 'ニコ生でVR配信してた人に案内してほしいと頼み込んでVRChat開始しました！1週間後にはフルトラ、VR睡眠生活はじめてました。' }
        ]
    },
    {
        year: '2021', events: [
            { month: '01', title: 'はじめてのVRChatでの年越し！VRダンスをしての年越し', description: '2021/01/01 00:00:00はPyPyDanceで踊って年越しました' },
            { month: '04', title: '籠り生活おわり？？別コミュニティ参加', description: '最初にいたコミュニティ以外のコミュニティにはじめて参加。ここから交友の広がりが大きくなり始めた気がします。' },
            { month: '05', title: 'これがVRアイドル！？ラジオ体操後のメインコンテンツ', description: 'ラジオ体操に参加したら終わった後に突然始まったパフォーマンス。はじめてVRアイドルを見ました' },
            { month: '06', title: 'はじめてのこまどアバター。2体目のアバター「ラスクちゃん」', description: '' },
            { month: '09', title: 'はじめてのプログラミングコンテスト？', description: '「初音ミク『マジカルミライ2021』プログラミング・コンテスト」に参加。イラスト担当兼デバッガー、サブコーダーとして協力し、優勝賞受賞' },
            { month: '10', title: '3体目のアバターはこまどアバター「ミルクちゃん」。そしてはじめてのお砂糖', description: 'ミルクちゃんは甘い香りがする' }
        ]
    },
    {
        year: '2022', events: [
            { month: '03', title: 'VRChat復帰と新しいコミュニティ', description: 'しばらくVRChatから離れてましたが復帰。ここらへんぐらいからこまどアバターメインのコミュニティに多く滞在することが増えた気がします' },
            { month: '07', title: 'はじめてのグループ立ち上げ', description: 'VRChatで意気投合したフレンドとVR団体である「BluePrint」を立ち上げました' },
            { month: '08', title: '師匠に写真を教わって本格的におはツイ開始！', description: 'フレンドでありお写真の師匠でもあるルチンちゃんから写真のイロハを学んで本格的におはツイ開始' },
            { month: '09', title: 'はじめてのPV製作', description: 'マネージャーとしてVRアイドルグループの1stPV製作を進行。絵コンテ、撮影、編集など実施。' },
            { month: '10', title: 'はじめてのアイドル応募', description: '裏方から表に露出するなら同じ正規ルートで合格するのが筋だと思ったので、みんなと同じ1期生募集の入り口からVRアイドルに応募。' },
            { month: '11', title: 'はじめてのアイドル', description: '1期生としてVRアイドルに合格。デビュー' },
            { month: '12', title: 'アイドルと運営', description: '全力でグループを盛り上げたかったのでVRアイドルグループの運営に参画' },
        ]
    },
    {
        year: '2023', events: [
            { month: '02', title: 'はじめての撮影会企画', description: 'グループに外部VRフォトグラファーを招待して写真の撮り方などをレクチャーしてもらったり写真を撮る楽しさを学ぶ会を企画' },
            { month: '03', title: 'はじめてのゲーム大会主催', description: 'グループでスプラトゥーン3の非公式大会としてVRChatter向けのゲーム大会を企画・主催、配信も実施' },
            { month: '04', title: 'はじめてのエイプリルフール企画', description: 'グループでエイプリルフールに合わせて何か出せないかと思い、企画・進行。グループ内のアイディアで出たファンタジー風のWebサイトを作成・公開' },
            { month: '05', title: 'はじめてのハーフアニバーサリー', description: 'グループのハーフアニバーサリーを企画と進行。そして最後には2期生募集のサプライズPV。2期生募集PVは企画、撮影、編集を実施' },
            { month: '06', title: '紹介動画の企画と作成', description: 'グループの2期生応募者向けにアピールするための動画「シュガラビに聞いてみた」の企画、撮影、編集実施。台本スクリプトも準備やレビューもしつつ連日撮りながら編集してました。でも編集するのがたのしくてこれがジーンくんの気持ちかなと思ってました。' },
            { month: '07', title: '第二回ゲーム大会開催', description: 'グループで第一回で好評だったスプラトゥーン3の非公式大会を実施。ローディング画面を新規に作ったり、自作トランジション作ったり新しい要素も取り入れてみてました。' },
            { month: '08', title: 'はじめての2期生のためのメンター制度', description: 'グループで元々昨年12月の時点で考案して温めていた姉妹制度を名称変えて「メンター制度」として2期生のサポートするための制度を実践。' },
            { month: '09', title: 'はじめてのワールド製作補助とApex非公式大会', description: 'グループで2期生発表用のワールドのデザインや設計、アセット集めなどを主導。スプラトゥーン2に続いてApexの非公式大会も企画・主催' },
            { month: '11', title: 'Apex非公式大会第二回主催', description: 'Apexの第二回非公式大会を運営サポートと実況役として協力' },
        ]
    },
    {
        year: '2024', events: [
            { month: '01', title: 'グループ脱退', description: '卒業しました' },
            { month: '02', title: 'はじめてのモデリングとはじめてのバレンタイン動画作成', description: '何かストーリー性のある2段構えの動画が作りたく、バレンタイン3日前にバレンタイン動画作ろうと思いついて2日で案出し、BGM探し、素材づくり、撮影、編集をやり切ったのですごくたのしかったです。ここで登場する3DのバレンタインチョコはBlenderで1から作ったので本当の手作りチョコですね？' },
            { month: '08', title: 'はじめてのサークルとしてのコミケ参加', description: '自分の出版物を出すのははじめてでした。こまどフレンド本を作りました。ぎりぎり間に合わなくてコピー本...' },
            { month: '10', title: 'はじめての製本編集', description: 'BluePrintの方で学園祭で出す活動誌の編集長を務めました。ぼくも1ページ寄稿してます。' },
            { month: '12', title: 'はじめての製本販売と冬コミ', description: '夏コミのリベンジとして原稿を間に合わせ製本を冬コミで出しました。夏コミに続いてこまどフレンドの話とこまどアバターの話の2本仕立て本' },
        ]
    },
    {
        year: '2025', events: [
            { month: '01', title: 'ショコラちゃん', description: '今のメインアバター。ショコラちゃんはかわいい' },
        ]
    }
];
